app/Admin/Controllers/AgentController.php

    protected function grid()
    {

        return Grid::make(new Agent(['member']), function (Grid $grid) {
            $grid->quickSearch(['id','name','title','invate_url'])->placeholder('ID，名字，标记，邀请码');
            $grid->column('id')->bold()->sortable();
            $grid->title->modal(AgentDetailsModal::make(['post_type'=> 2]));; // 开启树状表格功能
            //$grid->title->tree(); // 开启树状表格功能

            $grid->column('agency', '代理人数')->display(function () {
                $agentAll = Cache::remember('agent_cache', 20, function(){
                    return $this->all();
                });
                return collect(getMemberTeamId($agentAll, $this->id))->count() - 1;
            });

            $grid->column('member', '直推会员')->display(function ($value) {
                return collect($value)->count();
            });

            $grid->column('team', '团队人数')->display(function ($value) {
                $agentAll = Cache::remember('agent_cache', 20, function(){
                    return $this->all();
                });
                $memberAll = Cache::remember('member_cache', 20, function(){
                    return Member::get();
                });
                return collect($memberAll)->whereIn('agent_id', getMemberTeamId($agentAll, $this->id))->count();
            });
---
select * from `agent`
select * from `member`
select count(*) as aggregate from `member` where `agent_id` in (1, 3, 4, 7)
select * from `member` where `agent_id` in (1, 3, 4, 7)