app/Admin/Controllers/MemberController.php

select * from `system`
---
    protected function grid()
    {
        return Grid::make(new Member(['agent','company']), function (Grid $grid) {

            $grid->showQuickEditButton();
            $grid->column('id')->sortable();
            if(\Admin::user()->isRole('administrator')){
                $grid->selector(function (Grid\Tools\Selector $selector) {
                    $selector->select('company.title', '分公司', System::all()->pluck('title','id')->toArray());
                });
                $grid->column('company.title','分公司');