app/Admin/Metrics/Examples/NewDevices.php

select * from `system` limit 1
select sum(`balance`) as aggregate from `member`
---
    public function fill()
    {
        $sys = \App\Models\System::query()->first();
        $members = (int)\App\Models\Member::query()->sum('balance');