app/Admin/Metrics/Examples/NewUsers.php

            case '7':
            default:
                $days = Carbon::today()->subDays(7)->toDateTimeString();
                $newUsersCount = Member::query()->where('created_at','>',$days)->count();
---
select count(*) as aggregate from `member` where `created_at` > '2020-11-05 00:00:00'