app/Admin/Metrics/Examples/Sessions.php

select sum(`money`) as aggregate from `deposit` where `created_at` > '2020-11-06 00:00:00' and `status` = 1 and `deposit`.`deleted_at` is null
select sum(`money`) as aggregate from `withdraw` where `created_at` > '2020-11-06 00:00:00' and `status` = 1
---
    public function handle(Request $request)
    {
        switch ($request->get('option')) {
            case '365':
                $days = 365;
                break;
            case '30':
                $days = 30;
                break;
            case '28':
                $days = 28;
                break;
            case '7':
            default:
                $days = 7;
                break;
        }
        $totalDeposit = Deposit::query()
            ->where('created_at','>',Carbon::today()->subDays($days)->toDateTimeString())
            ->where('status',1)
            ->sum('money');
        $totalWithdraw = Withdraw::query()
            ->where('created_at','>',Carbon::today()->subDays($days)->toDateTimeString())
            ->where('status',1)
            ->sum('money');