app/Admin/Metrics/Examples/Tickets.php

    public function handle(Request $request)
    {
        switch ($request->get('option')) {
            case '365':
                $days = 365;
                break;
            case '30':
                $days = 30;
                break;
            case '28':
                $days = 28;
                break;
            case '7':
            default:
                $days = 7;
                break;
        }
        $all = Member::query()->count();
        $actived_member = Member::query()
            ->where('updated_at','>',Carbon::today()->subDays($days)->toDateTimeString());
        $deposit = Deposit::query()
            ->where('updated_at','>',Carbon::today()->subDays($days)->toDateTimeString());
        $withdraw = Withdraw::query()
            ->where('updated_at','>',Carbon::today()->subDays($days)->toDateTimeString());

        $this->withContent($actived_member->count());
        $this->withFooter($all,
            $deposit->sum('money').'/'.$deposit->count(),
            $withdraw->sum('money').'/'.$withdraw->count());
        // 图表数据
        $this->withChart(($actived_member->count()/$all)*100);
---
select count(*) as aggregate from `member`
select count(*) as aggregate from `member` where `updated_at` > '2020-11-06 00:00:00'
select count(*) as aggregate from `withdraw` where `updated_at` > '2020-11-06 00:00:00'
select count(*) as aggregate from `deposit` where `updated_at` > '2020-11-06 00:00:00' and `deposit`.`deleted_at` is null