app/Admin/Modal/AgentDetailsModal.php

    public function render()
    {
        // 获取ID
        $id = $this->key;

        // 获取其他自定义参数
        $type = $this->post_type;

        $data = Agent::where('id', $type)
            ->get(['title', 'name', 'invate_url'])
            ->toArray();
---
select `title`, `name`, `invate_url` from `agent` where `id` = '2'