app/Admin/Modal/AgentDetailsModal.php

select * from `agent`
select * from `member` where `member`.`agent_id` in (1, 2, 3, 4, 5, 6, 7)
select * from `member` where `member`.`agent_id` = 1 and `member`.`agent_id` is not null
select * from `member` where `member`.`agent_id` = 3 and `member`.`agent_id` is not null
select * from `deposit` where `created_at` between '2020-11-12' and '2020-11-12 23:41:18' and `deposit`.`deleted_at` is null
select * from `member` where `member`.`agent_id` = 2 and `member`.`agent_id` is not null
select * from `withdraw` where `created_at` between '2020-11-12' and '2020-11-12 23:41:19'
---
    public function render()
    {
        // 获取ID
        $id = $this->key;

        $agentAll = Cache::remember('agent_cache', 60, function(){
            return Agent::get();
        });
        $memberAll = Cache::remember('member_cache', 60, function(){
            return Member::get();
        });
        //今日充值
        $dayDeposit = Cache::remember('deposit_cache', 60, function(){
            return Deposit::whereBetween('created_at',  [
                Carbon::now()->toDateString(),
                Carbon::now()->toDateTimeString()
            ])->get();
        });

        //今日出金
        $dayWithdraw = Cache::remember('withdraw_cache', 60, function(){
            return Withdraw::whereBetween('created_at',  [
                Carbon::now()->toDateString(),
                Carbon::now()->toDateTimeString()
            ])->get();
        });